In [1]:
# 1.모듈 import
import sqlite3

# 2.DB 열기
conn = sqlite3.connect('BOAZ.db')

# 3. cursor(커서) 생성
cursor = conn.cursor()

In [2]:
############# DDL(Data Definition Language)
DROP_TABLE = """ 
        DROP TABLE IF EXISTS Orders;"""
cursor.execute(DROP_TABLE)

In [3]:
DROP_TABLE = """ 
        DROP TABLE IF EXISTS Customer;"""
cursor.execute(DROP_TABLE)

In [4]:
DROP_TABLE = """ 
        DROP TABLE IF EXISTS Book;"""
cursor.execute(DROP_TABLE)

In [5]:
# 4-1. SQL 명령어 작성
CREATE_CUSTOMER = """
    CREATE TABLE IF NOT EXISTS Customer (
  custid      INTEGER PRIMARY KEY,  
  name        VARCHAR(40),
  address     VARCHAR(50),
  phone       VARCHAR(20)
);"""

In [6]:
# 5-1. SQL 명령 실행
cursor.execute(CREATE_CUSTOMER)

In [7]:
# 4-2. SQL 명령어 작성
CREATE_BOOK = """
    CREATE TABLE IF NOT EXISTS Book (
      bookid      INTEGER PRIMARY KEY,
      bookname    VARCHAR(40),
      publisher   VARCHAR(40),
      price       INTEGER
      );"""

In [8]:
# 5-2. SQL 명령 실행
cursor.execute(CREATE_BOOK)

In [9]:
# 4-3. SQL 명령어 작성
CREATE_ORDERS = """
    CREATE TABLE IF NOT EXISTS Orders (
      orderid INTEGER PRIMARY KEY,
      custid  INTEGER ,
      bookid  INTEGER ,
      saleprice INTEGER ,
      orderdate date,
      FOREIGN KEY (custid) REFERENCES Customer(custid),
      FOREIGN KEY (bookid) REFERENCES Book(bookid)
    );"""

In [10]:
# 5-3. SQL 명령 실행
cursor.execute(CREATE_ORDERS)

In [11]:
# 잘 실행되었는지 Table 출력하여 확인
cursor.execute('SELECT * FROM sqlite_master WHERE type="table";')
table_list = cursor.fetchall()
for i in table_list:
    for j in i:
        print(j)
    print('----------------------')

table
Customer
Customer
2
CREATE TABLE Customer (
  custid      INTEGER PRIMARY KEY,
  name        VARCHAR(40),
  address     VARCHAR(50),
  phone       VARCHAR(20)
)
----------------------
table
Book
Book
3
CREATE TABLE Book (
      bookid      INTEGER PRIMARY KEY,
      bookname    VARCHAR(40),
      publisher   VARCHAR(40),
      price       INTEGER
      )
----------------------
table
Orders
Orders
4
CREATE TABLE Orders (
      orderid INTEGER PRIMARY KEY,
      custid  INTEGER ,
      bookid  INTEGER ,
      saleprice INTEGER ,
      orderdate date,
      FOREIGN KEY (custid) REFERENCES Customer(custid),
      FOREIGN KEY (bookid) REFERENCES Book(bookid)
    )
----------------------

In [11]:
########################### DML(Data Manipulation Language)
# insert sql 작성
INSERT_B_SQL = 'INSERT INTO Book(bookid,bookname,publisher,price) VALUES (?,?,?,?);'

Book = ((1, '축구의 역사', '굿스포츠', 7000),
(2, '축구아는 여자', '나무수', 13000),
(3, '축구의 이해', '대한미디어', 22000),
(4, '골프 바이블', '대한미디어', 35000),
(5, '피겨 교본', '굿스포츠', 8000),
(6, '역도 단계별기술', '굿스포츠', 6000),
(7, '야구의 추억', '이상미디어', 20000),
(8, '야구를 부탁해', '이상미디어', 13000),
(9, '올림픽 이야기', '삼성당', 7500),
(10, 'Olympic Champions', 'Pearson', 13000))

# 여러개 값 추가
cursor.executemany(INSERT_B_SQL,Book)
conn.commit()

In [12]:
# BOOOK T : 데이터 확인
cursor.execute('SELECT * FROM BOOK;')
item_list = cursor.fetchall()
for i in item_list:
    print(i)

(1, '축구의 역사', '굿스포츠', 7000)
(2, '축구아는 여자', '나무수', 13000)
(3, '축구의 이해', '대한미디어', 22000)
(4, '골프 바이블', '대한미디어', 35000)
(5, '피겨 교본', '굿스포츠', 8000)
(6, '역도 단계별기술', '굿스포츠', 6000)
(7, '야구의 추억', '이상미디어', 20000)
(8, '야구를 부탁해', '이상미디어', 13000)
(9, '올림픽 이야기', '삼성당', 7500)
(10, 'Olympic Champions', 'Pearson', 13000)

In [13]:
# insert sql 작성
INSERT_C_SQL = 'INSERT INTO Customer(custid,name,address,phone) VALUES (?,?,?,?);'

customers = ((1, '박지성', '영국 맨체스타', '000-5000-0001'),
(2, '김연아', '대한민국 서울', '000-6000-0001'),  
(3, '손흥민', '영국 맨체스타', '000-7000-0001'),
(4, '추신수', '미국 텍사스', '000-8000-0001'),
(5, '박세리', '대한민국 대전','NULL'))

# 여러개 값 추가
cursor.executemany(INSERT_C_SQL,customers)
conn.commit()

In [14]:
# CUSTOMER T : 데이터 확인
cursor.execute('SELECT * FROM CUSTOMER;')
item_list = cursor.fetchall()
for i in item_list:
    print(i)

(1, '박지성', '영국 맨체스타', '000-5000-0001')
(2, '김연아', '대한민국 서울', '000-6000-0001')
(3, '손흥민', '영국 맨체스타', '000-7000-0001')
(4, '추신수', '미국 텍사스', '000-8000-0001')
(5, '박세리', '대한민국 대전', 'NULL')

In [15]:
from sqlite3.dbapi2 import Date

# insert sql 작성
INSERT_O_SQL = 'INSERT INTO ORDERS(orderid, custid,bookid,saleprice,orderdate) VALUES (?,?,?,?,?);'

Orders = ((1, 1, 1, 6000, '2023-06-01'),
(2, 1, 3, 21000, '2023-06-03'),
(3, 2, 5, 8000, '2023-06-03'),
(4, 3, 6, 6000, '2023-06-04'),
(5, 4, 7, 20000,'2023-06-05'),
(6, 1, 2, 12000, '2023-06-07'),
(7, 4, 8, 13000,'2023-06-07'),
(8, 3, 10, 12000, '2023-06-08'),
(9, 2, 10, 7000, '2023-06-09'),
(10, 3, 8, 13000,'2023-06-10'))

# 여러개 값 추가
cursor.executemany(INSERT_O_SQL,Orders)
conn.commit()

In [16]:
# ORDER T : 데이터 확인
cursor.execute('SELECT * FROM ORDERS;')
item_list = cursor.fetchall()
for i in item_list:
    print(i)

(1, 1, 1, 6000, '2023-06-01')
(2, 1, 3, 21000, '2023-06-03')
(3, 2, 5, 8000, '2023-06-03')
(4, 3, 6, 6000, '2023-06-04')
(5, 4, 7, 20000, '2023-06-05')
(6, 1, 2, 12000, '2023-06-07')
(7, 4, 8, 13000, '2023-06-07')
(8, 3, 10, 12000, '2023-06-08')
(9, 2, 10, 7000, '2023-06-09')
(10, 3, 8, 13000, '2023-06-10')

In [17]:
# 도서의 총 개수
cursor.execute('SELECT count(bookid) FROM book;')
item_list = cursor.fetchall()
for i in item_list:
  print(i)

(10,)

In [18]:
# 가격이 13000원인 도서의 정보
cursor.execute("SELECT * FROM book where price = 13000;")
item_list = cursor.fetchall()
for i in item_list:
  print(i)
cursor.close()

(2, '축구아는 여자', '나무수', 13000)
(8, '야구를 부탁해', '이상미디어', 13000)
(10, 'Olympic Champions', 'Pearson', 13000)

In [19]:
# 마당서점에 도서를 출고하는 출판사의 총 개수
cursor = conn.cursor()
cursor.execute("SELECT count(distinct publisher) FROM book;")
item_list = cursor.fetchall()
for i in item_list:
  print(i)

(6,)

In [20]:
# 2023.06.04~2023.06.07 사이에 주문받은 도서의 주문번호
cursor.execute("SELECT * FROM orders WHERE orderdate between '2023-06-04' and '2023-06-07';")
item_list = cursor.fetchall()
for i in item_list:
  print(i)

(4, 3, 6, 6000, '2023-06-04')
(5, 4, 7, 20000, '2023-06-05')
(6, 1, 2, 12000, '2023-06-07')
(7, 4, 8, 13000, '2023-06-07')

In [21]:
# 성이 '김'씨이고 이름이‘아'로 끝나는 고객의 이름과 주소
cursor.execute("SELECT name, address FROM customer WHERE name LIKE '김%아';")
item_list = cursor.fetchall()
for i in item_list:
  print(i)

('김연아', '대한민국 서울')

In [22]:
# 출판사 당 입고 도서 권수
cursor.execute("SELECT publisher, count(*) FROM Book GROUP BY publisher;")
item_list = cursor.fetchall()
for i in item_list:
  print(i)

('Pearson', 1)
('굿스포츠', 3)
('나무수', 1)
('대한미디어', 2)
('삼성당', 1)
('이상미디어', 2)

In [23]:
# 손흥민의 주소 : 맨체스터 -> 토트넘
UPDATE_SQL = "UPDATE customer set address = '영국 토트넘' WHERE name = '손흥민';"
cursor.execute(UPDATE_SQL)

conn.commit()

In [24]:
# 확인
cursor.execute("SELECT * FROM customer;")
item_list = cursor.fetchall()
for i in item_list:
  print(i)

(1, '박지성', '영국 맨체스타', '000-5000-0001')
(2, '김연아', '대한민국 서울', '000-6000-0001')
(3, '손흥민', '영국 토트넘', '000-7000-0001')
(4, '추신수', '미국 텍사스', '000-8000-0001')
(5, '박세리', '대한민국 대전', 'NULL')

In [25]:
# NULL 값 삭제
DELETE_SQL = 'DELETE FROM customer WHERE phone = "NULL";'
cursor.execute(DELETE_SQL)
conn.commit()

In [26]:
# 확인
cursor.execute("SELECT * FROM customer;")
item_list = cursor.fetchall()
for i in item_list:
  print(i)

(1, '박지성', '영국 맨체스타', '000-5000-0001')
(2, '김연아', '대한민국 서울', '000-6000-0001')
(3, '손흥민', '영국 토트넘', '000-7000-0001')
(4, '추신수', '미국 텍사스', '000-8000-0001')

In [27]:
# 손흥민의 주소 : 맨체스터 -> 토트넘
INSERT_SQL = "INSERT INTO customer(custid, name, address, phone) VALUES (5,'이강인','스페인 마요르카','000-9000-0001');"
cursor.execute(INSERT_SQL)

conn.commit()

In [28]:
# 이강인 정보 추가 삽입
cursor.execute("SELECT * FROM customer;")
item_list = cursor.fetchall()
for i in item_list:
  print(i)

(1, '박지성', '영국 맨체스타', '000-5000-0001')
(2, '김연아', '대한민국 서울', '000-6000-0001')
(3, '손흥민', '영국 토트넘', '000-7000-0001')
(4, '추신수', '미국 텍사스', '000-8000-0001')
(5, '이강인', '스페인 마요르카', '000-9000-0001')

In [29]:
# 6. DB 닫기
conn.close()